app/views/hours/index.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
              <tr id="dashfield">
                <td><%= hour.user.first_name + " " +hour.user.last_name %></td>