app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
          <tbody>
          <% @allusers.defaultuser.each do |user| %>