app/controllers/hours_controller.rb

  def index
    @allhours = HourLog.where(status:'Pending')
    @allconfirm = HourLog.where(status:'Confirmed')
    @alltotal = HourLog.sum(:hours)
---
SELECT "hour_logs".* FROM "hour_logs"  WHERE "hour_logs"."status" = 'Pending'
SELECT SUM("hour_logs"."hours") AS sum_id FROM "hour_logs"  WHERE "hour_logs"."status" = 'Confirmed'
SELECT SUM("hour_logs"."hours") AS sum_id FROM "hour_logs"

  def new
    @hour = current_user.hour_logs.new
    @entry = current_user.hour_logs.all
    @total = current_user.hour_logs.sum(:hours)
---
SELECT "hour_logs".* FROM "hour_logs"  WHERE "hour_logs"."user_id" = ?  [["user_id", 1]]
SELECT SUM("hour_logs"."hours") AS sum_id FROM "hour_logs"  WHERE "hour_logs"."user_id" = ?  [["user_id", 1]]