app/controllers/users_controller.rb

  def index
    @allusers = User.all
---
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)
    @user.role = 'User'
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "role", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @userdelete = User.find(params[:id])
    @hourdelete = HourLog.where(user_id: @userdelete.id)
    @hourdelete.each do |delete|
      delete.destroy
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]